---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\te48local\Dropbox\Coal Bonding\Code\Log\kentucky_data_compilation 8 Feb 2021.log
  log type:  text
 opened on:   8 Feb 2021, 16:12:44

. set more off

. 
. ************************************************************************************
. ************************************************************************************
. /*
> DO FILE NAME: kentucky_data_compilation.do
> DO FILE AUTHORS:  Tom Eisenberg
> SOURCE:  None
> 
> PURPOSE: Reads in and manipulates the Kentucky coal bonding data
> 
> DATE CREATED: 02/02/2021
> 
> NOTES: 
> 
> CHANGES:
> 
> */
. 
. *Files this do file uses
. ************************************************************************************
. ******* .xlsx files
. local kydata "$MASTER\Data\Bond Spreadsheets\Kentucky\Bonds_and_bond_activities_12032020.xlsx"

. 
. 
. * Files this do file produces
. ************************************************************************************
. ******* .dta files
. local kydstata "$MASTER\Data\Bond Spreadsheets\Kentucky\kentucky_raw_stata.dta"

. 
. ** Import original Excel file - takes a while so better off using stata file to start
. 
. *import excel using "`kydata'", firstrow 
. 
. *save "$MASTER\Data\Bond Spreadsheets\Kentucky\kentucky_raw_stata.dta", replace
. 
. ** Import stata file of kentucky bond data
. 
. use "$MASTER\Data\Bond Spreadsheets\Kentucky\kentucky_raw_stata.dta", clear

. 
. 
. /*
> ** Restrict to TWO permits first for a test case
> 
> *keep if ORIGINAL_PERMIT_NUMBER=="0070019" | ORIGINAL_PERMIT_NUMBER=="8260558" | ORIGINAL_PERMIT_NUMBER=="9000022"
> *keep if ORIGINAL_PERMIT_NUMBER=="0070001" | ORIGINAL_PERMIT_NUMBER=="0070008" | ORIGINAL_PERMIT_NUMBER=="9020013" | ORIGINAL_PERMIT_NUMBER=="917
> 0012"
> */
. 
. * Drop extraneous rows
. drop if BOND_ACTIVITY_CODE==""
(4,343 observations deleted)

. 
. 
. * Convert to dates, extrtact relevant years and months
. gen bond_issue_date = date(BOND_ISSUE_DATE, "MDY")
(20 missing values generated)

. gen bond_issue_year = year(bond_issue_date)
(20 missing values generated)

. gen bond_issue_month = month(bond_issue_date)
(20 missing values generated)

. format bond_issue_date %td

. 
. gen bond_activity_date = dofc(BOND_ACTIVITY_DATE)

. gen bond_activity_year = year(bond_activity_date)

. gen bond_activity_month = month(bond_activity_date)

. 
. 
. * Count how many years a bond is active
. bysort PERMBOND_ID: egen min_year = min(bond_issue_year)
(20 missing values generated)

. bysort PERMBOND_ID: egen max_year = max(bond_activity_year)

. 
. gen num_years = max_year - min_year
(20 missing values generated)

. 
. 
. * Get the unique bond totals for each activity line
. 
. * Mark which instance of a year a bond shows up
. sort ORIGINAL_PERMIT_NUMBER PERMBOND_ID bond_issue_year  bond_activity_year bond_activity_month

. 
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID bond_issue_year : gen bond_instance = _n

. 
. 
. 
. * Replace missing bond amounts with 0 (?)
. replace BOND_AMOUNT_THIS_ACTIVITY = 0 if BOND_AMOUNT_THIS_ACTIVITY==.
(4,515 real changes made)

. 
. 
. 
. **** Get bond totals for first instances based on status
. 
. * Add reductions for first instances
. gen running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="RD" & bond_instance==1
(152,344 missing values generated)

. 
. * Add part release grading for first instances
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="RG" & bond_instance==1
(15,773 real changes made)

. 
. * Ignore release denials for first instances
. replace running_bond_total = ORIGINAL_BOND_AMOUNT if BOND_ACTIVITY_CODE=="CD" & bond_instance==1
(817 real changes made)

. 
. * Ignore release denials for first instances
. replace running_bond_total = ORIGINAL_BOND_AMOUNT if BOND_ACTIVITY_CODE=="PD" & bond_instance==1
(1,002 real changes made)

. 
. * BS: should go to 0 and new total is reflected in new bond (if there is one)
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY  if BOND_ACTIVITY_CODE=="BS" & bond_instance==1
(16,119 real changes made)

. 
. * Ignore OS for first instances
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="OS" & bond_instance==1
(808 real changes made)

. 
. * SF: should go to 0 and new total is reflected in new bond (if there is one)
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY  if BOND_ACTIVITY_CODE=="SF" & bond_instance==1
(8 real changes made)

. 
. * RV: should go to 0 and new total is reflected in new bond (if there is one)
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY  if BOND_ACTIVITY_CODE=="RV" & bond_instance==1
(471 real changes made)

. 
. * SU: should go to 0 and new total is reflected in new bond
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY  if BOND_ACTIVITY_CODE=="SU" & bond_instance==1
(15,093 real changes made)

. 
. * Add PAs for first instances
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="PA" & bond_instance==1
(2,160 real changes made)

. 
. * Add UCs for first instances
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="UC" & bond_instance==1
(21 real changes made)

. 
. * Add AMs for first instances - looks like it can alter amounts
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="AM" & bond_instance==1
(288 real changes made)

. 
. * Add OPs for first instances - looks like it can alter amounts
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="OP" & bond_instance==1
(195 real changes made)

. 
. * RC goes to 0
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="RC" & bond_instance==1
(18,096 real changes made)

. 
. * Add riders
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="RI" & bond_instance==1
(6,927 real changes made)

. 
. * Add complete overlaps
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="OL" & bond_instance==1
(720 real changes made)

. 
. * Add forfeitures
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="FF" & bond_instance==1
(267 real changes made)

. 
. * Add DRs
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="DR" & bond_instance==1
(1,191 real changes made)

. 
. * Add AOs
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="AO" & bond_instance==1
(173 real changes made)

. 
. * Add VFs
. replace running_bond_total = ORIGINAL_BOND_AMOUNT + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="VF" & bond_instance==1
(74 real changes made)

. 
. * Ignore DF for first instances - FF is the actual action
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="DF" & bond_instance==1
(1,588 real changes made)

. 
. * Ignore OF for first instances - FF is the actual action
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="OF" & bond_instance==1
(319 real changes made)

. 
. * Ignore NF for first instances - FF is the actual action
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="NF" & bond_instance==1
(606 real changes made)

. 
. * Ignore LU for first instances
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="LU" & bond_instance==1
(5 real changes made)

. 
. * Ignore FE for first instances - FF is the actual action
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="FE" & bond_instance==1
(3 real changes made)

. 
. * Ignore HP
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="HP" & bond_instance==1
(219 real changes made)

. 
. * Ignore LS
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="LS" & bond_instance==1
(19 real changes made)

. 
. * Ignore DL
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="DL" & bond_instance==1
(50 real changes made)

. 
. * Ignore UD
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="UD" & bond_instance==1
(100 real changes made)

. 
. * Ignore FL--seems to happen when a DF doesn't fully go through
. replace running_bond_total = ORIGINAL_BOND_AMOUNT  if BOND_ACTIVITY_CODE=="UD" & bond_instance==1
(0 real changes made)

. 
. 
. * Max number of bond instances is 15
. 
. forvalues i = 2/15 {
  2.         
. 
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> RD" & bond_instance==`i'
  3. 
. * Add part release grading for first instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> RG" & bond_instance==`i'
  4. 
. 
. * RV: should go to 0 and new total is reflected in new bond
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY  if BOND_ACTIVITY_CODE==
> "RV" & bond_instance==`i'
  5. 
. * Ignore release denials for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="CD" & bond_instance==`i'
  6. 
. 
. * Ignore OS for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1]  if BOND_ACTIVITY_CODE=="OS" & bond_instance==`i'
  7. 
. * BS: should go to 0 and new total is reflected in new bond
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY  if BOND_ACTIVITY_CODE==
> "BS" & bond_instance==`i'
  8. 
. * SF: should go to 0 and new total is reflected in new bond
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY  if BOND_ACTIVITY_CODE==
> "SF" & bond_instance==`i'
  9. 
. * SU: should go to 0 and new total is reflected in new bond
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY  if BOND_ACTIVITY_CODE==
> "SU" & bond_instance==`i'
 10. 
. * Add riders
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY  if BOND_ACTIVITY_CODE==
> "RI" & bond_instance==`i'
 11. 
. * Add PAs for first instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> PA" & bond_instance==`i'
 12. 
. * RC goes to 0
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> RC" & bond_instance==`i'
 13. 
. * FF goes to 0
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> FF" & bond_instance==`i'
 14. 
. * Ignore release denials for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="PD" & bond_instance==`i'
 15. 
. * Ignore DF for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="DF" & bond_instance==`i'
 16. 
. * Ignore OF for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="OF" & bond_instance==`i'
 17. 
. * Ignore LU for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="LU" & bond_instance==`i'
 18. 
. * Ignore OS for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="OS" & bond_instance==`i'
 19. 
. * Ignore NF for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="NF" & bond_instance==`i'
 20. 
. * Ignore NF for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="NF" & bond_instance==`i'
 21. 
. * Ignore HP for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="HP" & bond_instance==`i'
 22. 
. * Ignore LS for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="LS" & bond_instance==`i'
 23. 
. * Ignore LS for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="FE" & bond_instance==`i'
 24.         
. * Ignore DL for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="DL" & bond_instance==`i'   
 25. 
. * Ignore UD for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="UD" & bond_instance==`i'   
 26. 
. 
. * Ignore FL for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] if BOND_ACTIVITY_CODE=="FL" & bond_instance==`i'   
 27. 
. * Add AMs for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> AM" & bond_instance==`i'
 28. 
. * Add OPs for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> OP" & bond_instance==`i'
 29. 
. * Add UCss for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> UC" & bond_instance==`i'
 30. 
. * Add OLs for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> OL" & bond_instance==`i'
 31. 
. * Add DRs for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> DR" & bond_instance==`i'
 32. 
. * Add AOs for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> AO" & bond_instance==`i'
 33. 
. * Add VFs for all instances
. by ORIGINAL_PERMIT_NUMBER PERMBOND_ID: replace running_bond_total = running_bond_total[_n-1] + BOND_AMOUNT_THIS_ACTIVITY if BOND_ACTIVITY_CODE=="
> VF" & bond_instance==`i'
 34. 
. }
(4372 real changes made)
(7069 real changes made)
(504 real changes made)
(671 real changes made)
(1392 real changes made)
(3778 real changes made)
(34 real changes made)
(3033 real changes made)
(2276 real changes made)
(334 real changes made)
(6727 real changes made)
(740 real changes made)
(385 real changes made)
(589 real changes made)
(727 real changes made)
(39 real changes made)
(0 real changes made)
(223 real changes made)
(0 real changes made)
(337 real changes made)
(62 real changes made)
(7 real changes made)
(183 real changes made)
(100 real changes made)
(151 real changes made)
(78 real changes made)
(128 real changes made)
(27 real changes made)
(126 real changes made)
(474 real changes made)
(95 real changes made)
(77 real changes made)
(961 real changes made)
(2825 real changes made)
(208 real changes made)
(531 real changes made)
(608 real changes made)
(2189 real changes made)
(74 real changes made)
(1503 real changes made)
(895 real changes made)
(88 real changes made)
(4542 real changes made)
(1688 real changes made)
(164 real changes made)
(349 real changes made)
(347 real changes made)
(188 real changes made)
(0 real changes made)
(99 real changes made)
(0 real changes made)
(230 real changes made)
(170 real changes made)
(19 real changes made)
(466 real changes made)
(33 real changes made)
(172 real changes made)
(29 real changes made)
(75 real changes made)
(19 real changes made)
(82 real changes made)
(201 real changes made)
(61 real changes made)
(84 real changes made)
(381 real changes made)
(828 real changes made)
(109 real changes made)
(200 real changes made)
(329 real changes made)
(724 real changes made)
(59 real changes made)
(484 real changes made)
(392 real changes made)
(35 real changes made)
(2196 real changes made)
(1106 real changes made)
(65 real changes made)
(129 real changes made)
(122 real changes made)
(309 real changes made)
(0 real changes made)
(45 real changes made)
(0 real changes made)
(143 real changes made)
(168 real changes made)
(18 real changes made)
(274 real changes made)
(15 real changes made)
(132 real changes made)
(12 real changes made)
(24 real changes made)
(32 real changes made)
(10 real changes made)
(83 real changes made)
(41 real changes made)
(74 real changes made)
(132 real changes made)
(287 real changes made)
(40 real changes made)
(109 real changes made)
(152 real changes made)
(247 real changes made)
(30 real changes made)
(205 real changes made)
(197 real changes made)
(14 real changes made)
(679 real changes made)
(629 real changes made)
(24 real changes made)
(67 real changes made)
(62 real changes made)
(182 real changes made)
(0 real changes made)
(22 real changes made)
(0 real changes made)
(80 real changes made)
(104 real changes made)
(7 real changes made)
(141 real changes made)
(11 real changes made)
(80 real changes made)
(0 real changes made)
(14 real changes made)
(33 real changes made)
(8 real changes made)
(35 real changes made)
(12 real changes made)
(34 real changes made)
(67 real changes made)
(105 real changes made)
(12 real changes made)
(44 real changes made)
(90 real changes made)
(77 real changes made)
(22 real changes made)
(75 real changes made)
(91 real changes made)
(4 real changes made)
(266 real changes made)
(292 real changes made)
(20 real changes made)
(25 real changes made)
(30 real changes made)
(92 real changes made)
(0 real changes made)
(5 real changes made)
(0 real changes made)
(40 real changes made)
(49 real changes made)
(2 real changes made)
(73 real changes made)
(3 real changes made)
(37 real changes made)
(0 real changes made)
(6 real changes made)
(28 real changes made)
(2 real changes made)
(34 real changes made)
(3 real changes made)
(9 real changes made)
(21 real changes made)
(54 real changes made)
(5 real changes made)
(31 real changes made)
(29 real changes made)
(47 real changes made)
(18 real changes made)
(32 real changes made)
(47 real changes made)
(1 real change made)
(111 real changes made)
(155 real changes made)
(9 real changes made)
(20 real changes made)
(4 real changes made)
(45 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(24 real changes made)
(34 real changes made)
(1 real change made)
(34 real changes made)
(2 real changes made)
(15 real changes made)
(1 real change made)
(3 real changes made)
(13 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(2 real changes made)
(19 real changes made)
(22 real changes made)
(10 real changes made)
(14 real changes made)
(12 real changes made)
(17 real changes made)
(7 real changes made)
(16 real changes made)
(21 real changes made)
(3 real changes made)
(48 real changes made)
(75 real changes made)
(1 real change made)
(12 real changes made)
(6 real changes made)
(19 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(9 real changes made)
(17 real changes made)
(0 real changes made)
(20 real changes made)
(2 real changes made)
(8 real changes made)
(0 real changes made)
(0 real changes made)
(10 real changes made)
(1 real change made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(15 real changes made)
(2 real changes made)
(11 real changes made)
(4 real changes made)
(8 real changes made)
(3 real changes made)
(8 real changes made)
(12 real changes made)
(0 real changes made)
(26 real changes made)
(35 real changes made)
(0 real changes made)
(8 real changes made)
(1 real change made)
(17 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made)
(11 real changes made)
(0 real changes made)
(6 real changes made)
(1 real change made)
(5 real changes made)
(1 real change made)
(0 real changes made)
(7 real changes made)
(0 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(6 real changes made)
(1 real change made)
(3 real changes made)
(4 real changes made)
(2 real changes made)
(1 real change made)
(3 real changes made)
(9 real changes made)
(0 real changes made)
(16 real changes made)
(21 real changes made)
(1 real change made)
(6 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(3 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(4 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(0 real changes made)
(4 real changes made)
(5 real changes made)
(1 real change made)
(1 real change made)
(5 real changes made)
(3 real changes made)
(0 real changes made)
(7 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(1 real change made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(2 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(2 real changes made)
(7 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
end of do-file

. browse ORIGINAL_PERMIT_NUMBER PERMIT_NUMBER PERMBOND_ID bond_issue_year bond_activity_year bond_activity_month bond_instance BOND_ACTIVITY_CODE O
> RIGINAL_BOND_AMOUNT BOND_AMOUNT_THIS_ACTIVITY bond_instance running_bond_total

